<!DOCTYPE html>
<html>
<head>
<style>
div.header
{
	background-color:#f4f4f4;
	text-align:left;
	border-bottom:solid;
	border-bottom-color:#00A7DE;
}
div
{
	text-align: justify
}
</style>
</head>

<body>

<div>
<div class="header">
Information g&eacute;n&eacute;rale
<br />
&nbsp;
</div>
HFR4BB est une application d&eacute;velopp&eacute;e par un membre du forum, Amonchakai, et non l'&eacute;quippe du site hardware.fr<br/>
Pour toute questions, demande de nouvelle fonctionnalit&eacute;, retour de bug, ... il est possible de me contacter soit par MP sur le forum, ou en se rendant sur topic de l'application sur le forum.
<UL TYPE=\"circle\">
<LI><a href="http://forum.hardware.fr/message.php?config=hfr.inc&cat=prive&sond=&p=1&subcat=&dest=Amonchakai&subcatgroup=0">MP &agrave; Amonchakai</a>
<LI><a href="http://forum.hardware.fr/hfr/gsmgpspda/telephone/projet-hfr4bb-blackberry-sujet_27709_1.htm">Le topic sur le forum</a></UL>
</div>
&nbsp;
<div>
<div class="header">
Acc&egrave;s au code
<br />
&nbsp;
</div>
Le code de l'application est opensource, il est possible d'y acc&eacute;der en allant sur le site de l'application sur github o&ugrave; vous pouvez acc&eacute;der au d&eacute;tail de l'implementation, faire une branche alternative, soumettre des mise &agrave; jour, ...
<UL TYPE=\"circle\">
<LI><a href="https://github.com/amonchakai/HFRBlack">Site de l'application</a>
</UL>
</div>
&nbsp;
<div>
<div class="header">
Confidentialit&eacute; et vie priv&eacute;e
<br />
&nbsp;
</div>
Comme vous pouvez le v&eacute;rifier dans le code de l'application (voir ci-dessus), aucune information relative au mot de passe n'est stock&eacute; au sein de l'application. La gestion de l'authentification est r&eacute;alis&eacute;e &agrave; l'aide d'un cookie fourni par le site forum.hardware.fr. Le pseudo de l'utilisateur sera par contre enregistr&eacute; de fa&ccedil;on non encrypt&eacute;  dans l'application dans un fichier texte, ceci dans le but d'afficher le nom de l'utilisateur dans la page de r&eacute;glage. Ce fichier sera d&eacute;truit lors de la d&eacute;connexion. La configuration de l'application est &eacute;galement stock&eacute;e dans un fichier texte dans le dossier de l'application. Les avatars des autres utilisateurs, sont eux aussi mis en cache dans le dossier de l'application. Aucune autre information ne sera stock&eacute; par l'application. 
</div>
&nbsp;
<div>
<div class="header">
Remerciement
<br />
&nbsp;
</div>
Je remercie tout particuli&egrave;rement:
<UL TYPE=\"circle\">
<LI> ToYonos, pour avoir distribu&eacute; le code de son application HFR4droid qui a &eacute;t&eacute; d'une grande aide &agrave; la r&eacute;alisation de l'application. Ainsi que pour ses explications sur quelques points technique lors de la r&eacute;alisation de l'application.
<LI> thefolken, &agrave; qui j'ai sournoisement copi&eacute; le design de son application HFR+ sur plateforme iOS ainsi que certaines ic&ocirc;nes.
<LI> _-Sky-_ qui m'a aid&eacute; lors du d&eacute;veloppent de l'application via ses conseils sur l'interface et retour de bugs. 
<LI> Mes b&ecirc;ta testeurs sur HFR :-)
<LI> Et naturellement, ceux qui installeront mon app' ;-)
</UL>
</div>

</body>
</html>